week3 회고록

Week3 심화 포스팅 주제
- Magic Method (피터)
- Partial Dependece Plot(써리)
- Color(렉사)
- Latex (폴라)
- 추천시스템 (도리토스)

## 피터
- 데이터는 필요에 맞게 시각적요소로 변환하여 이해하기 쉽게 시각적으로 전달해야한다.
- 결국 많이 써봐야 Seaborn같은 데이터 시각화 툴에 적응이 될거같다
- 안수빈 마스터님의 3가지 생각에 공감했다(지속가능한 개발자가 되어야한다)
    - 코딩 잘하는 개발자는 많다
    - 순위와 실력은 유지하기 어렵다
    - 개인의 시간,능력에는 한계가 있다. 
- 정리와 기록을 많이 남겨야겠다는 생각이 들었다

## 렉사
- 시각화 과제가 없어서 아쉬웠다
- 심화 포스팅 주제를 다음주에는 미리 생각해야겠다고 생각했다.

## 도리토스
시각화에 대해서 따로 공부를 깊게 한 적은 없어서 그래프를 그릴 때 기능 같은 것들을 잘 몰라서 사용하지 못 했거나 원하는대로 설정하지 못 했던 경우가 많았었다. 
시각화 강의를 보면서 subplot을 더 쉽게 다룰 수 있고 원하는 정보를 원활하게 전달할 수 있을 것 같다! 주말에 코드를 하나하나 직접 타이핑해보면서 익숙해지도록 해봐야겠다.

## 폴라
- 시간적으로 많이 부족해서 공부를 투자할 시간이 없었다.

## 써리
- 시각화는 그냥 필요할때만 검색해서 활용했는데 이번 기회에 쭉 훑어볼 수 있어서 더 다양한 그래프를 만들 수 있을 것 같다. 
- 배운걸로 트렌드를 살펴보는 짧은 레포트 하나 써봐도 재밌을 것 같다.